In [1]:
import pandas as pd

In [2]:
fish = pd.read_csv('E:\GitHub репозитории\Data-Science-course-by-miracl6\CSV\\fish.csv')
fish

    Species  Weight  Length1  Length2  Length3   Height   Width
0     Bream   242.0     23.2     25.4     30.0  11.5200  4.0200
1     Bream   290.0     24.0     26.3     31.2  12.4800  4.3056
2     Bream   340.0     23.9     26.5     31.1  12.3778  4.6961
3     Bream   363.0     26.3     29.0     33.5  12.7300  4.4555
4     Bream   430.0     26.5     29.0     34.0  12.4440  5.1340
..      ...     ...      ...      ...      ...      ...     ...
154   Smelt    12.2     11.5     12.2     13.4   2.0904  1.3936
155   Smelt    13.4     11.7     12.4     13.5   2.4300  1.2690
156   Smelt    12.2     12.1     13.0     13.8   2.2770  1.2558
157   Smelt    19.7     13.2     14.3     15.2   2.8728  2.0672
158   Smelt    19.9     13.8     15.0     16.2   2.9322  1.8792

[159 rows x 7 columns]

In [3]:
fish['Species']

0      Bream
1      Bream
2      Bream
3      Bream
4      Bream
       ...
154    Smelt
155    Smelt
156    Smelt
157    Smelt
158    Smelt
Name: Species, Length: 159, dtype: object

In [4]:
fish[['Species']]

    Species
0     Bream
1     Bream
2     Bream
3     Bream
4     Bream
..      ...
154   Smelt
155   Smelt
156   Smelt
157   Smelt
158   Smelt

[159 rows x 1 columns]

In [5]:
fish[fish['Weight'] > 1_000]

    Species  Weight  Length1  Length2  Length3   Height   Width
121   Perch  1015.0     37.0     40.0     42.4  12.3808  7.4624
123   Perch  1100.0     39.0     42.0     44.6  12.8002  6.8684
125   Perch  1100.0     40.1     43.0     45.5  12.5125  7.4165
141    Pike  1250.0     52.0     56.0     59.7  10.6863  6.9849
142    Pike  1600.0     56.0     60.0     64.0   9.6000  6.1440
143    Pike  1550.0     56.0     60.0     64.0   9.6000  6.1440
144    Pike  1650.0     59.0     63.4     68.0  10.8120  7.4800

In [6]:
df = pd.DataFrame(data=[[200, 150], [5000.5, 1500.1]],
                 index=['python', 'sql'],
                 columns=['student', 'price'])
df

        student   price
python    200.0   150.0
sql      5000.5  1500.1

In [7]:
df.loc[['python']]

        student  price
python    200.0  150.0

In [8]:
df.loc[:, 'price']

python     150.0
sql       1500.1
Name: price, dtype: float64

In [9]:
df.iloc[0]

student    200.0
price      150.0
Name: python, dtype: float64

In [10]:
df.iloc[1]

student    5000.5
price      1500.1
Name: sql, dtype: float64

In [11]:
df.iloc[:1, 1:]

        price
python  150.0

## Задача 1

	col1	col2	col3
a	100.0	200.0	300.0
b	5.0	4.0	3.0
c	10.5	11.4	12.3

In [12]:
df = pd.DataFrame(data=[[100.0, 200.0, 300], [5.0, 4.0, 3.0], [10.5, 11.4, 12.3]],
                 index=['a', 'b', 'c'],
                 columns=['col1', 'col2', 'col3'])
df

    col1   col2   col3
a  100.0  200.0  300.0
b    5.0    4.0    3.0
c   10.5   11.4   12.3

result_one - строку по индексу a при помощи loc
result_two - столбец col2 при помощи loc
result_three - столбцы датасета col2 и сol3 при помощи iloc
result_four - последнюю строку при помощи iloc (тип pd.DataFrame)

In [13]:
result_one = df.loc['a']
result_one

col1    100.0
col2    200.0
col3    300.0
Name: a, dtype: float64

In [14]:
result_two = df.loc[:, 'col2']
result_two

a    200.0
b      4.0
c     11.4
Name: col2, dtype: float64

In [15]:
result_three = df.iloc[:, 1:3]
result_three

    col2   col3
a  200.0  300.0
b    4.0    3.0
c   11.4   12.3

In [16]:
result_four = df.iloc[-1:, :]
result_four

   col1  col2  col3
c  10.5  11.4  12.3

In [17]:
fish.shape

(159, 7)

In [18]:
fish.size

1113

In [20]:
fish.dtypes

Species     object
Weight     float64
Length1    float64
Length2    float64
Length3    float64
Height     float64
Width      float64
dtype: object

In [23]:
fish.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 159 entries, 0 to 158
Data columns (total 7 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Species  159 non-null    object
 1   Weight   159 non-null    float64
 2   Length1  159 non-null    float64
 3   Length2  159 non-null    float64
 4   Length3  159 non-null    float64
 5   Height   159 non-null    float64
 6   Width    159 non-null    float64
dtypes: float64(6), object(1)
memory usage: 8.8+ KB

In [24]:
fish.info(verbose=False)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 159 entries, 0 to 158
Columns: 7 entries, Species to Width
dtypes: float64(6), object(1)
memory usage: 8.8+ KB

In [37]:
fish.columns.tolist()

['Species', 'Weight', 'Length1', 'Length2', 'Length3', 'Height', 'Width']

In [39]:
fish.index.tolist()

[0,
 1,
 2,
 3,
 4,
 5,
 6,
 7,
 8,
 9,
 10,
 11,
 12,
 13,
 14,
 15,
 16,
 17,
 18,
 19,
 20,
 21,
 22,
 23,
 24,
 25,
 26,
 27,
 28,
 29,
 30,
 31,
 32,
 33,
 34,
 35,
 36,
 37,
 38,
 39,
 40,
 41,
 42,
 43,
 44,
 45,
 46,
 47,
 48,
 49,
 50,
 51,
 52,
 53,
 54,
 55,
 56,
 57,
 58,
 59,
 60,
 61,
 62,
 63,
 64,
 65,
 66,
 67,
 68,
 69,
 70,
 71,
 72,
 73,
 74,
 75,
 76,
 77,
 78,
 79,
 80,
 81,
 82,
 83,
 84,
 85,
 86,
 87,
 88,
 89,
 90,
 91,
 92,
 93,
 94,
 95,
 96,
 97,
 98,
 99,
 100,
 101,
 102,
 103,
 104,
 105,
 106,
 107,
 108,
 109,
 110,
 111,
 112,
 113,
 114,
 115,
 116,
 117,
 118,
 119,
 120,
 121,
 122,
 123,
 124,
 125,
 126,
 127,
 128,
 129,
 130,
 131,
 132,
 133,
 134,
 135,
 136,
 137,
 138,
 139,
 140,
 141,
 142,
 143,
 144,
 145,
 146,
 147,
 148,
 149,
 150,
 151,
 152,
 153,
 154,
 155,
 156,
 157,
 158]

In [40]:
fish.describe()

            Weight     Length1     Length2     Length3      Height       Width
count   159.000000  159.000000  159.000000  159.000000  159.000000  159.000000
mean    398.326415   26.247170   28.415723   31.227044    8.970994    4.417486
std     357.978317    9.996441   10.716328   11.610246    4.286208    1.685804
min       0.000000    7.500000    8.400000    8.800000    1.728400    1.047600
25%     120.000000   19.050000   21.000000   23.150000    5.944800    3.385650
50%     273.000000   25.200000   27.300000   29.400000    7.786000    4.248500
75%     650.000000   32.700000   35.500000   39.650000   12.365900    5.584500
max    1650.000000   59.000000   63.400000   68.000000   18.957000    8.142000

In [42]:
fish.describe(include='object')  # top - это наиболее распространенное значение

       Species
count      159
unique       7
top      Perch
freq        56

In [45]:
fish.nunique()

Species      7
Weight     101
Length1    116
Length2     93
Length3    124
Height     154
Width      152
dtype: int64

In [46]:
fish.nunique(axis=1)

0      7
1      7
2      7
3      7
4      7
      ..
154    6
155    7
156    7
157    7
158    7
Length: 159, dtype: int64

In [49]:
fish.Species.unique()  # Уникальные элементы возвращаются в порядке их определения в Series

array(['Bream', 'Roach', 'Whitefish', 'Parkki', 'Perch', 'Pike', 'Smelt'],
      dtype=object)

**value_counts()** - подсчет количества уникальных строк в DataFrame, результат вернет в виде Series. Какие параметры внутри него доступны:

параметр **normalize** - возвратить пропорции, а не частоты, тип bool. По умолчанию False

In [50]:
fish['Species'].value_counts(normalize=True)

Perch        0.352201
Bream        0.220126
Roach        0.125786
Pike         0.106918
Smelt        0.088050
Parkki       0.069182
Whitefish    0.037736
Name: Species, dtype: float64

In [51]:
fish['Species'].value_counts()

Perch        56
Bream        35
Roach        20
Pike         17
Smelt        14
Parkki       11
Whitefish     6
Name: Species, dtype: int64

## Задача 2

In [54]:
orders = pd.read_csv('E:\GitHub репозитории\Data-Science-course-by-miracl6\CSV\\orders.csv')
orders

      transactionId  visitorId        date  revenue group
0                 0          0  2021-03-15     1633     B
1                 1          1  2021-03-15      659     B
2                 2       1070  2021-03-15      411     A
3                 3          3  2021-03-15     9688     B
4                 4          4  2021-03-15     2221     B
...             ...        ...         ...      ...   ...
1192           1192       1192  2021-03-14     6478     B
1193           1193       1193  2021-03-14     3185     A
1194           1194       1194  2021-03-14    10514     A
1195           1195       1195  2021-03-14       81     A
1196           1196       1196  2021-03-15   202680     B

[1197 rows x 5 columns]

In [55]:
orders['date'].value_counts()

2021-03-05    48
2021-03-14    47
2021-03-12    47
2021-03-06    46
2021-03-15    46
2021-03-01    45
2021-03-28    45
2021-03-02    44
2021-03-27    44
2021-03-08    43
2021-03-19    43
2021-03-29    42
2021-03-07    42
2021-03-22    41
2021-03-09    41
2021-03-26    41
2021-03-03    40
2021-03-23    40
2021-03-10    39
2021-03-16    38
2021-03-21    37
2021-03-30    35
2021-03-13    35
2021-03-04    33
2021-03-20    32
2021-03-31    32
2021-03-24    31
2021-03-11    26
2021-03-18    26
2021-03-17    24
2021-03-25    24
Name: date, dtype: int64